app/controllers/clientes_controller.rb

SELECT "clientes".* FROM "clientes" WHERE (id = '2') ORDER BY "clientes"."id" ASC LIMIT ?  [["LIMIT", 1]]
DELETE FROM "clientes" WHERE "clientes"."id" = ?  [["id", 2]]
---
  def delete
    @cliente = Cliente.where("id = ?", params[:id]).first
    @cliente.destroy