app/controllers/servicos_controller.rb

SELECT "servicos".* FROM "servicos"
---
  def index
    @servicos = Servico.all

SELECT "servicos".* FROM "servicos" WHERE "servicos"."trabalhador_id" = ?  [["trabalhador_id", 1]]
---
  def ListagemServicos
    @servicos = Servico.where(trabalhador_id: params[:trabalhador_id])

SELECT "trabalhadors".* FROM "trabalhadors" WHERE "trabalhadors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "servicos" ("nome", "descricao", "valor", "horarioInicio", "horarioTermino", "data", "trabalhador_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @trabalhador = Trabalhador.find(servico_params[:trabalhador_id])
    @servico = Servico.new(servico_params)
    @trabalhador.servicos << @servico

DELETE FROM "servicos" WHERE "servicos"."id" = ?  [["id", 4]]
---
  def destroy
    @servico.destroy

SELECT "servicos".* FROM "servicos" WHERE "servicos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_servico
      @servico = Servico.find(params[:id])