app/controllers/trabalhadors_controller.rb

  def index
    @trabalhadors = Trabalhador.all
---
SELECT "trabalhadors".* FROM "trabalhadors"

  def show
    @trabalhadors = Trabalhador.all.where(id: params[:id]).first
---
SELECT "trabalhadors".* FROM "trabalhadors" WHERE "trabalhadors"."id" = ? ORDER BY "trabalhadors"."id" ASC LIMIT ?  [["id", nil], ["LIMIT", 1]]